import os

import pandas as pd

from config import ROOT_DIR

path_to_data = os.path.join(ROOT_DIR, "data")

import pytest


@pytest.fixture
def transactions():
    return [{'Дата операции': '31.12.2021 16:44:00', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': '-160,89', 'Валюта операции': 'RUB', 'Сумма платежа': '-160,89', 'Валюта платежа': 'RUB', 'Кэшбэк': '', 'Категория': 'Супермаркеты', 'MCC': '5411', 'Описание': 'Колхоз', 'Бонусы (включая кэшбэк)': '3,00', 'Округление на инвесткопилку': '0,00', 'Сумма операции с округлением': '160,89'}, {'Дата операции': '31.12.2021 16:42:04', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': '-64,00', 'Валюта операции': 'RUB', 'Сумма платежа': '-64,00', 'Валюта платежа': 'RUB', 'Кэшбэк': '', 'Категория': 'Супермаркеты', 'MCC': '5411', 'Описание': 'Колхоз', 'Бонусы (включая кэшбэк)': '1,00', 'Округление на инвесткопилку': '0,00', 'Сумма операции с округлением': '64,00'}, {'Дата операции': '31.12.2021 16:39:04', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': '-118,12', 'Валюта операции': 'RUB', 'Сумма платежа': '-118,12', 'Валюта платежа': 'RUB', 'Кэшбэк': '', 'Категория': 'Супермаркеты', 'MCC': '5411', 'Описание': 'Магнит', 'Бонусы (включая кэшбэк)': '2,00', 'Округление на инвесткопилку': '0,00', 'Сумма операции с округлением': '118,12'}, {'Дата операции': '31.12.2021 15:44:39', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': '-78,05', 'Валюта операции': 'RUB', 'Сумма платежа': '-78,05', 'Валюта платежа': 'RUB', 'Кэшбэк': '', 'Категория': 'Супермаркеты', 'MCC': '5411', 'Описание': 'Колхоз', 'Бонусы (включая кэшбэк)': '1,00', 'Округление на инвесткопилку': '0,00', 'Сумма операции с округлением': '78,05'}, {'Дата операции': '31.12.2021 01:23:42', 'Дата платежа': '31.12.2021', 'Номер карты': '*5091', 'Статус': 'OK', 'Сумма операции': '-564,00', 'Валюта операции': 'RUB', 'Сумма платежа': '-564,00', 'Валюта платежа': 'RUB', 'Кэшбэк': '', 'Категория': 'Различные товары', 'MCC': '5399', 'Описание': 'Ozon.ru', 'Бонусы (включая кэшбэк)': '5,00', 'Округление на инвесткопилку': '0,00', 'Сумма операции с округлением': '564,00'},{"Дата операции": "31.12.2021 16:39:04", "Дата платежа": "31.12.2021", "Номер карты": "*7197", "Статус": "OK", "Сумма операции": "-118,12", "Валюта операции": "RUB", "Сумма платежа": "-118,12", "Валюта платежа": "RUB", "Кэшбэк": "", "Категория": "Супермаркеты", "MCC": "5411", "Описание": "Магнит", "Бонусы (включая кэшбэк)": "2,00", "Округление на инвесткопилку": "0,00", "Сумма операции с округлением": "118,12"}, {"Дата операции": "15.06.2020 13:38:22", "Дата платежа": "15.06.2020", "Номер карты": "", "Статус": "OK", "Сумма операции": "-1600,00", "Валюта операции": "RUB", "Сумма платежа": "-1600,00", "Валюта платежа": "RUB", "Кэшбэк": "", "Категория": "Переводы", "MCC": "", "Описание": "Мария В.", "Бонусы (включая кэшбэк)": "0,00", "Округление на инвесткопилку": "0,00", "Сумма операции с округлением": "1600,00"}, {"Дата операции": "31.05.2020 10:41:28", "Дата платежа": "31.05.2020", "Номер карты": "*4556", "Статус": "OK", "Сумма операции": "300,00", "Валюта операции": "RUB", "Сумма платежа": "300,00", "Валюта платежа": "RUB", "Кэшбэк": "", "Категория": "Переводы", "MCC": "", "Описание": "Наталья Г.", "Бонусы (включая кэшбэк)": "0,00", "Округление на инвесткопилку": "0,00", "Сумма операции с округлением": "300,00"}, {"Дата операции": "18.10.2018 17:00:25", "Дата платежа": "18.10.2018", "Номер карты": "", "Статус": "OK", "Сумма операции": "-40,00", "Валюта операции": "RUB", "Сумма платежа": "-40,00", "Валюта платежа": "RUB", "Кэшбэк": "", "Категория": "Мобильная связь", "MCC": "", "Описание": "Билайн +7 962 717-08-52", "Бонусы (включая кэшбэк)": "0,00", "Округление на инвесткопилку": "0,00", "Сумма операции с округлением": "40,00"}, {"Дата операции": "03.07.2018 21:30:39", "Дата платежа": "03.07.2018", "Номер карты": "", "Статус": "OK", "Сумма операции": "-150,00", "Валюта операции": "RUB", "Сумма платежа": "-150,00", "Валюта платежа": "RUB", "Кэшбэк": "", "Категория": "Мобильная связь", "MCC": "", "Описание": "МТС +7 981 127-94-00", "Бонусы (включая кэшбэк)": "1,00", "Округление на инвесткопилку": "0,00", "Сумма операции с округлением": "150,00"}]

@pytest.fixture
def json_sample():
    return [{'Дата операции': '12.12.2021 19:44:10', 'Дата платежа': '13.12.2021', 'Номер карты': '*5091', 'Статус': 'OK', 'Сумма операции': '-14,60', 'Валюта операции': 'RUB', 'Сумма платежа': '-14,60', 'Валюта платежа': 'RUB', 'Кэшбэк': '', 'Категория': 'Каршеринг', 'MCC': '7512', 'Описание': 'Ситидрайв', 'Бонусы (включая кэшбэк)': '0,00', 'Округление на инвесткопилку': '0,00', 'Сумма операции с округлением': '14,60'}, {'Дата операции': '12.12.2021 15:03:30', 'Дата платежа': '12.12.2021', 'Номер карты': '*5091', 'Статус': 'OK', 'Сумма операции': '1721,38', 'Валюта операции': 'RUB', 'Сумма платежа': '1721,38', 'Валюта платежа': 'RUB', 'Кэшбэк': '', 'Категория': 'Каршеринг', 'MCC': '7512', 'Описание': 'Ситидрайв', 'Бонусы (включая кэшбэк)': '-86,00', 'Округление на инвесткопилку': '0,00', 'Сумма операции с округлением': '1721,38'}, {'Дата операции': '11.12.2021 19:16:58', 'Дата платежа': '11.12.2021', 'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': '-70,00', 'Валюта операции': 'RUB', 'Сумма платежа': '-70,00', 'Валюта платежа': 'RUB', 'Кэшбэк': '', 'Категория': 'Супермаркеты', 'MCC': '5411', 'Описание': 'Колхоз', 'Бонусы (включая кэшбэк)': '1,00', 'Округление на инвесткопилку': '0,00', 'Сумма операции с округлением': '70,00'}, {'Дата операции': '11.12.2021 19:16:28', 'Дата платежа': '11.12.2021', 'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': '-34,00', 'Валюта операции': 'RUB', 'Сумма платежа': '-34,00', 'Валюта платежа': 'RUB', 'Кэшбэк': '', 'Категория': 'Фастфуд', 'MCC': '5814', 'Описание': 'Rumyanyj Khleb', 'Бонусы (включая кэшбэк)': '0,00', 'Округление на инвесткопилку': '0,00', 'Сумма операции с округлением': '34,00'}]

@pytest.fixture
def wrong_json_list():
    return "{'Дата операции': '12.12.2021 19:44:10', 'Номер карты': *5091, 'Статус': 'OK'}"

@pytest.fixture
def simple_search_expected():
    return ('[{"Дата операции": "31.12.2021 16:44:00", "Дата платежа": "31.12.2021", '
 '"Номер карты": "*7197", "Статус": "OK", "Сумма операции": "-160,89", "Валюта '
 'операции": "RUB", "Сумма платежа": "-160,89", "Валюта платежа": "RUB", '
 '"Кэшбэк": "", "Категория": "Супермаркеты", "MCC": "5411", "Описание": '
 '"Колхоз", "Бонусы (включая кэшбэк)": "3,00", "Округление на инвесткопилку": '
 '"0,00", "Сумма операции с округлением": "160,89"}, {"Дата операции": '
 '"31.12.2021 16:42:04", "Дата платежа": "31.12.2021", "Номер карты": "*7197", '
 '"Статус": "OK", "Сумма операции": "-64,00", "Валюта операции": "RUB", "Сумма '
 'платежа": "-64,00", "Валюта платежа": "RUB", "Кэшбэк": "", "Категория": '
 '"Супермаркеты", "MCC": "5411", "Описание": "Колхоз", "Бонусы (включая '
 'кэшбэк)": "1,00", "Округление на инвесткопилку": "0,00", "Сумма операции с '
 'округлением": "64,00"}, {"Дата операции": "31.12.2021 16:39:04", "Дата '
 'платежа": "31.12.2021", "Номер карты": "*7197", "Статус": "OK", "Сумма '
 'операции": "-118,12", "Валюта операции": "RUB", "Сумма платежа": "-118,12", '
 '"Валюта платежа": "RUB", "Кэшбэк": "", "Категория": "Супермаркеты", "MCC": '
 '"5411", "Описание": "Магнит", "Бонусы (включая кэшбэк)": "2,00", "Округление '
 'на инвесткопилку": "0,00", "Сумма операции с округлением": "118,12"}, {"Дата '
 'операции": "31.12.2021 15:44:39", "Дата платежа": "31.12.2021", "Номер '
 'карты": "*7197", "Статус": "OK", "Сумма операции": "-78,05", "Валюта '
 'операции": "RUB", "Сумма платежа": "-78,05", "Валюта платежа": "RUB", '
 '"Кэшбэк": "", "Категория": "Супермаркеты", "MCC": "5411", "Описание": '
 '"Колхоз", "Бонусы (включая кэшбэк)": "1,00", "Округление на инвесткопилку": '
 '"0,00", "Сумма операции с округлением": "78,05"}, {"Дата операции": '
 '"31.12.2021 16:39:04", "Дата платежа": "31.12.2021", "Номер карты": "*7197", '
 '"Статус": "OK", "Сумма операции": "-118,12", "Валюта операции": "RUB", '
 '"Сумма платежа": "-118,12", "Валюта платежа": "RUB", "Кэшбэк": "", '
 '"Категория": "Супермаркеты", "MCC": "5411", "Описание": "Магнит", "Бонусы '
 '(включая кэшбэк)": "2,00", "Округление на инвесткопилку": "0,00", "Сумма '
 'операции с округлением": "118,12"}]')

@pytest.fixture
def telephone_numbers_expected():
    return ('[{"Дата операции": "18.10.2018 17:00:25", "Дата платежа": "18.10.2018", '
 '"Номер карты": "", "Статус": "OK", "Сумма операции": "-40,00", "Валюта '
 'операции": "RUB", "Сумма платежа": "-40,00", "Валюта платежа": "RUB", '
 '"Кэшбэк": "", "Категория": "Мобильная связь", "MCC": "", "Описание": "Билайн '
 '+7 962 717-08-52", "Бонусы (включая кэшбэк)": "0,00", "Округление на '
 'инвесткопилку": "0,00", "Сумма операции с округлением": "40,00"}, {"Дата '
 'операции": "03.07.2018 21:30:39", "Дата платежа": "03.07.2018", "Номер '
 'карты": "", "Статус": "OK", "Сумма операции": "-150,00", "Валюта операции": '
 '"RUB", "Сумма платежа": "-150,00", "Валюта платежа": "RUB", "Кэшбэк": "", '
 '"Категория": "Мобильная связь", "MCC": "", "Описание": "МТС +7 981 '
 '127-94-00", "Бонусы (включая кэшбэк)": "1,00", "Округление на '
 'инвесткопилку": "0,00", "Сумма операции с округлением": "150,00"}]')

@pytest.fixture
def personal_search_expected():
    return ('[{"Дата операции": "15.06.2020 13:38:22", "Дата платежа": "15.06.2020", '
 '"Номер карты": "", "Статус": "OK", "Сумма операции": "-1600,00", "Валюта '
 'операции": "RUB", "Сумма платежа": "-1600,00", "Валюта платежа": "RUB", '
 '"Кэшбэк": "", "Категория": "Переводы", "MCC": "", "Описание": "Мария В.", '
 '"Бонусы (включая кэшбэк)": "0,00", "Округление на инвесткопилку": "0,00", '
 '"Сумма операции с округлением": "1600,00"}, {"Дата операции": "31.05.2020 '
 '10:41:28", "Дата платежа": "31.05.2020", "Номер карты": "*4556", "Статус": '
 '"OK", "Сумма операции": "300,00", "Валюта операции": "RUB", "Сумма платежа": '
 '"300,00", "Валюта платежа": "RUB", "Кэшбэк": "", "Категория": "Переводы", '
 '"MCC": "", "Описание": "Наталья Г.", "Бонусы (включая кэшбэк)": "0,00", '
 '"Округление на инвесткопилку": "0,00", "Сумма операции с округлением": '
 '"300,00"}]')

@pytest.fixture
def df_1():
    return pd.read_excel(os.path.join(path_to_data, 'test_operations_1.xlsx'), engine="openpyxl")

@pytest.fixture
def df_2():
    return pd.read_excel(os.path.join(path_to_data, 'test_operations_1.xlsx'), engine="openpyxl")

@pytest.fixture
def mock_currency_response():
    return [{'currency': 'USD', 'rate': 78.75}, {'currency': 'EUR', 'rate': 91.05}]
