import json
import os
import re
from typing import Any

from config import ROOT_DIR
from src.logger import get_logger

path = os.path.join(ROOT_DIR, "data", "operations.json")
logger = get_logger(__name__)


def get_transactions(path_to_file: str) -> Any:
    logger.info(f"Формирование транзакций из файла {path_to_file}")
    with open(path_to_file, "r", encoding="utf-8") as file:
        operations_data = json.load(file)
    logger.info('Список транзакций успешно сформирован')
    return operations_data


def search_item(transactions: list[dict], item: str) -> list[dict]|str:
    result = []
    logger.info(f'Начало работы функции поиска по ключевому слову. Ключевое слово {item}')
    for transaction in transactions:
        if re.search(item.lower(), transaction["Категория"].lower()) or re.search(item.lower(), transaction["Описание"].lower()) is not None:
            result.append(transaction)
    if len(result) == 0:
        logger.info('Совпадений не найдено')
        return 'Совпадений не найдено'
    logger.info('Успешное завершение функции')
    return json.dumps(result, ensure_ascii=False)


def search_telephone_numbers(transactions: list[dict]) -> list[dict]|str:
    result = []
    logger.info('Начало работы функции поиска по номерам телефонов.')
    for transaction in transactions:
        if re.search(r'[+7]\s\d{3}\s\d{3}-\d{2}-\d{2}', transaction['Описание']) is not None:
            result.append(transaction)
    if len(result) == 0:
        logger.info('Совпадений не найдено')
        return 'Телефонных номеров не найдено'
    logger.info('Успешное завершение функции')
    return json.dumps(result, ensure_ascii=False)


def search_personal_transactions(transactions: list[dict]) -> list[dict]|str:
    result = []
    logger.info('Начало работы функции поиска по именам.')
    for transaction in transactions:
        if transaction['Категория'] == 'Переводы' and re.search(r'\w{3,}\s\w\.$', transaction['Описание']) is not None:
            result.append(transaction)
    if len(result) == 0:
        logger.info('Совпадений не найдено')
        return 'Переводов физическим лицам не найдено'
    logger.info('Успешное завершение функции')
    return json.dumps(result, ensure_ascii=False)


list_of_transactions = get_transactions(path)
#print(list_of_transactions[120:124])
#list_of_transactions = [{'Дата операции': '31.12.2021 16:44:00', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': '-160,89', 'Валюта операции': 'RUB', 'Сумма платежа': '-160,89', 'Валюта платежа': 'RUB', 'Кэшбэк': '', 'Категория': 'Супермаркеты', 'MCC': '5411', 'Описание': 'Колхоз', 'Бонусы (включая кэшбэк)': '3,00', 'Округление на инвесткопилку': '0,00', 'Сумма операции с округлением': '160,89'}, {'Дата операции': '31.12.2021 16:42:04', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': '-64,00', 'Валюта операции': 'RUB', 'Сумма платежа': '-64,00', 'Валюта платежа': 'RUB', 'Кэшбэк': '', 'Категория': 'Супермаркеты', 'MCC': '5411', 'Описание': 'Колхоз', 'Бонусы (включая кэшбэк)': '1,00', 'Округление на инвесткопилку': '0,00', 'Сумма операции с округлением': '64,00'}, {'Дата операции': '31.12.2021 16:39:04', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': '-118,12', 'Валюта операции': 'RUB', 'Сумма платежа': '-118,12', 'Валюта платежа': 'RUB', 'Кэшбэк': '', 'Категория': 'Супермаркеты', 'MCC': '5411', 'Описание': 'Магнит', 'Бонусы (включая кэшбэк)': '2,00', 'Округление на инвесткопилку': '0,00', 'Сумма операции с округлением': '118,12'}, {'Дата операции': '31.12.2021 15:44:39', 'Дата платежа': '31.12.2021', 'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': '-78,05', 'Валюта операции': 'RUB', 'Сумма платежа': '-78,05', 'Валюта платежа': 'RUB', 'Кэшбэк': '', 'Категория': 'Супермаркеты', 'MCC': '5411', 'Описание': 'Колхоз', 'Бонусы (включая кэшбэк)': '1,00', 'Округление на инвесткопилку': '0,00', 'Сумма операции с округлением': '78,05'}, {'Дата операции': '31.12.2021 01:23:42', 'Дата платежа': '31.12.2021', 'Номер карты': '*5091', 'Статус': 'OK', 'Сумма операции': '-564,00', 'Валюта операции': 'RUB', 'Сумма платежа': '-564,00', 'Валюта платежа': 'RUB', 'Кэшбэк': '', 'Категория': 'Различные товары', 'MCC': '5399', 'Описание': 'Ozon.ru', 'Бонусы (включая кэшбэк)': '5,00', 'Округление на инвесткопилку': '0,00', 'Сумма операции с округлением': '564,00'},{"Дата операции": "31.12.2021 16:39:04", "Дата платежа": "31.12.2021", "Номер карты": "*7197", "Статус": "OK", "Сумма операции": "-118,12", "Валюта операции": "RUB", "Сумма платежа": "-118,12", "Валюта платежа": "RUB", "Кэшбэк": "", "Категория": "Супермаркеты", "MCC": "5411", "Описание": "Магнит", "Бонусы (включая кэшбэк)": "2,00", "Округление на инвесткопилку": "0,00", "Сумма операции с округлением": "118,12"}, {"Дата операции": "15.06.2020 13:38:22", "Дата платежа": "15.06.2020", "Номер карты": "", "Статус": "OK", "Сумма операции": "-1600,00", "Валюта операции": "RUB", "Сумма платежа": "-1600,00", "Валюта платежа": "RUB", "Кэшбэк": "", "Категория": "Переводы", "MCC": "", "Описание": "Мария В.", "Бонусы (включая кэшбэк)": "0,00", "Округление на инвесткопилку": "0,00", "Сумма операции с округлением": "1600,00"}, {"Дата операции": "31.05.2020 10:41:28", "Дата платежа": "31.05.2020", "Номер карты": "*4556", "Статус": "OK", "Сумма операции": "300,00", "Валюта операции": "RUB", "Сумма платежа": "300,00", "Валюта платежа": "RUB", "Кэшбэк": "", "Категория": "Переводы", "MCC": "", "Описание": "Наталья Г.", "Бонусы (включая кэшбэк)": "0,00", "Округление на инвесткопилку": "0,00", "Сумма операции с округлением": "300,00"}, {"Дата операции": "18.10.2018 17:00:25", "Дата платежа": "18.10.2018", "Номер карты": "", "Статус": "OK", "Сумма операции": "-40,00", "Валюта операции": "RUB", "Сумма платежа": "-40,00", "Валюта платежа": "RUB", "Кэшбэк": "", "Категория": "Мобильная связь", "MCC": "", "Описание": "Билайн +7 962 717-08-52", "Бонусы (включая кэшбэк)": "0,00", "Округление на инвесткопилку": "0,00", "Сумма операции с округлением": "40,00"}, {"Дата операции": "03.07.2018 21:30:39", "Дата платежа": "03.07.2018", "Номер карты": "", "Статус": "OK", "Сумма операции": "-150,00", "Валюта операции": "RUB", "Сумма платежа": "-150,00", "Валюта платежа": "RUB", "Кэшбэк": "", "Категория": "Мобильная связь", "MCC": "", "Описание": "МТС +7 981 127-94-00", "Бонусы (включая кэшбэк)": "1,00", "Округление на инвесткопилку": "0,00", "Сумма операции с округлением": "150,00"}]
#print(search_item(list_of_transactions, 'супермаркет'))
#print(search_telephone_numbers(list_of_transactions))
#print(search_personal_transactions(list_of_transactions))